DataProcessors/КоличествоПрисоединенныхФайловЗаПериод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>КоличествоПрисоединенныхФайловЗаПериод</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/КоличествоПрисоединенныхФайловЗаПериод/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	//  получить массив дат
	
	датаМассив=Новый Массив;
	
	счДата=Объект.ДатаНачала;
	
	ТЧ.Очистить();
	
	Если Объект.ДатаНачала<Объект.ДатаКонец Тогда
	    
			Пока  счДата<=Объект.ДатаКонец  Цикл
				
				датаМассив.Добавить(счДата);
				
				счДата=счДата+60*60*24;
				
			
			КонецЦикла;

			
			
			
   			продол= ПостроитьТаблицуТемп(датаМассив);
			
		   Если продол Тогда
		   
		   	     ЗаполнитьТаблицуТЧ();
		   
		   КонецЕсли;	
			
			
			
		    ЭтаФорма.Элементы.ГруппаПечать.Видимость=Истина;

	
	КонецЕсли;
		
	
	//Сообщить("Ок");
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьТаблицуТЧ()

	
	 сотрПр=Новый Массив;
	 
	 сотрПр.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Войлошникова Ольга"));
	 сотрПр.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Самусева Светлана Сергеевна"));
	 сотрПр.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Обухова Юлия Владимировна"));
	 сотрПр.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Рыбалко Ирина"));
	 сотрПр.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Бердюгина Виктория"));
	 сотрПр.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Булгаков Александр"));
	 
	 
	 
	 
	 
	 периодКонец=Объект.ДатаКонец;
	 периодНачало=Объект.ДатаНачала;
	 
	 
	 
		 Для каждого сотр Из сотрПр Цикл
			 
			    	//  добавлю строку в ТЧ
						   новаяСтрока=ТЧ.Добавить();
						   новаяСтрока.Сотрудник=сотр.Наименование;
						   
						          итогоСтрока=0;
								 Пока периодНачало<=периодКонец  Цикл
														   
									   стрКолонкаИмя=ПолучитьИмяКолонки(периодНачало);					   
									   
									   итогоДень=СколькоФайловВДень(сотр, периодНачало);
									   
									    итогоСтрока=итогоСтрока+итогоДень; 

									   // Вставить колич файлов за этот день.
									   новаяСтрока[стрКолонкаИмя]= Строка(итогоДень);
				 					 
									   периодНачало=периодНачало+60*60*24; 
									   
								 
								 КонецЦикла;  
								 
						новаяСтрока.Итого=итогоСтрока;		 
								 
				 периодКонец=Объект.ДатаКонец;
		         периодНачало=Объект.ДатаНачала;
								 
		 
		 КонецЦикла;
	 	 
	   	
КонецПроцедуры


&НаСервере
Функция СколькоФайловВДень(сотр, датаСозд)

	
	 колФайлов=0;
	            
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СведенияОФайлах.Автор КАК Автор,
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОФайлах.Файл) КАК ФайлКол
				|ИЗ
				|	РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
				|ГДЕ
				|	СведенияОФайлах.Автор = &Автор
				|	И СведенияОФайлах.ДатаСоздания МЕЖДУ &ДатаСоздания  И &ДатаСоздания1
				|
				|СГРУППИРОВАТЬ ПО
				|	СведенияОФайлах.Автор";
			
			Запрос.УстановитьПараметр("Автор", сотр);
			Запрос.УстановитьПараметр("ДатаСоздания", датаСозд);
			Запрос.УстановитьПараметр("ДатаСоздания1", датаСозд+60*60*24-1);
			
			
			
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				колФайлов=ВыборкаДетальныеЗаписи.ФайлКол;
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	Возврат колФайлов;
	

КонецФункции // ()

 


&НаСервере
Функция ПолучитьИмяКолонки(датаК)

	    стрДата=Формат(датаК,"ДФ=yyyy-MM-dd");
		стрДата=СтрЗаменить(стрДата,"-","_");
		стрДата="к"+стрДата;

		
  Возврат стрДата;		

КонецФункции // ()




&НаСервере
Функция ПостроитьТаблицуТемп(СтрМ)

	
	      ТЗ = РеквизитФормыВЗначение("ТЧ");
		
		  
		   колКол=ТЗ.Колонки.Количество();
		   
		   Если колКол>0 Тогда
			   
			  // 
			  // наУд=Новый Массив;
			  // 
			  // Для каждого тзкол  Из ТЗ.Колонки Цикл
			  // 
			  // 	   наУд.Добавить(тзкол);
			  // 
			  // КонецЦикла;
			  // 
			  // 
			  //Для каждого стрку  Из наУд Цикл
			  //    
			  //         ТЗ.Колонки.Удалить(стрку);
			  //	
			  //
			  //КонецЦикла;
			  // 
			   
								  
				
				   Возврат Ложь;
		   
		   КонецЕсли;
		  
			ТЗ.Колонки.Добавить("Сотрудник",,"Сотрудник");
			
			   Для каждого мас Из СтрМ Цикл

				    стрДата=Формат(мас,"ДФ=yyyy-MM-dd");
					
					стрДата=СтрЗаменить(стрДата,"-","_");
					стрДата="к"+стрДата;
				   
			        ТЗ.Колонки.Добавить(стрДата);

				   
			   КонецЦикла;
			   
	     ТЗ.Колонки.Добавить("Итого",,"Итого");
        		   
					   
			   
			   
			     //Опишем массив реквизитов
    МассивРеквизитов = Новый Массив;
    МассивТипаВыбора = Новый Массив;
    МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
    ОписаниеТипаВыбора = Новый ОписаниеТипов(МассивТипаВыбора);
    
    //Добавим в массив реквизитов таблицу значений
    МассивРеквизитов.Добавить(Новый РеквизитФормы("ДанныеФайла", ОписаниеТипаВыбора));
  
	//Добавим в массив реквизитов колонки таблицы
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТЧ"));
		
	КонецЦикла;
  
    ИзменитьРеквизиты(МассивРеквизитов);
    
     //Добавим Таблицу на форму
    ТаблицаДанныхФайла             = Элементы.Добавить("ТаблицаДанныхФайла", Тип("ТаблицаФормы"),ЭтаФорма.Элементы.ГруппаТаблица);
    ТаблицаДанныхФайла.ПутьКДанным = "ТЧ";
    ТаблицаДанныхФайла.Отображение = ОтображениеТаблицы.Список;
	ТаблицаДанныхФайла.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	
	
	//ТаблицаДанныхФайла.Родитель=ЭтаФорма.Элементы.ГруппаОбработка;
	
    //Добавим колонки
    Для Каждого Колонка Из ТЗ.Колонки Цикл
        НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаДанныхФайла);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = "ТЧ." + Колонка.Имя;
		
		
		Если Колонка.Имя<>"Сотрудник" И Колонка.Имя<>"Итого" Тогда
		
		    	СтрокаДата= СтрЗаменить(Колонка.Имя,"_","-");
				
				СтрокаДата=Прав(СтрокаДата,СтрДлина(СтрокаДата)-1);
				СтрокаДата= СтрЗаменить(СтрокаДата,"-","");
				
				ТекДата = Дата(СтрокаДата+"000000");
				
				НовыйЭлемент.Заголовок=Формат(ТекДата,"ДЛФ=DD");
		
		
		КонецЕсли;
					
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
    КонецЦикла;  
	
	ЗначениеВРеквизитФормы(ТЗ,"ТЧ");
  		    
			
  Возврат Истина;
	
	
КонецФункции // ()

&НаКлиенте
Процедура Печать(Команда)
	
	 ТД=ПоказатьТЧ();
     ТД.Показать();
	
	
	
КонецПроцедуры

&НаСервере
Функция ПоказатьТЧ()

	            датаМассив=Новый Массив;
	
	            счДата=Объект.ДатаНачала;
  
				Пока  счДата<=Объект.ДатаКонец  Цикл
				
					датаМассив.Добавить(счДата);
					
					счДата=счДата+60*60*24;
					
			
			    КонецЦикла;

				
				
				
      		    ТЗ = Новый ТаблицаЗначений;

				
				ТЗ.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("Строка"),"Сотрудник");
				
				   Для каждого мас Из датаМассив Цикл

					    стрДата=Формат(мас,"ДФ=yyyy-MM-dd");
						
						стрДата=СтрЗаменить(стрДата,"-","_");
						стрДата="к"+стрДата;
						
							    СтрокаДата= СтрЗаменить(стрДата,"_","-");
								
								СтрокаДата=Прав(СтрокаДата,СтрДлина(СтрокаДата)-1);
								СтрокаДата= СтрЗаменить(СтрокаДата,"-","");
								
								ТекДата = Дата(СтрокаДата+"000000");

						
				        ТЗ.Колонки.Добавить(стрДата,Новый ОписаниеТипов("Строка"),Формат(ТекДата,"ДЛФ=DD"));

					   
				   КонецЦикла;
				   
		     ТЗ.Колонки.Добавить("Итого",Новый ОписаниеТипов("Число"),"Итого");
			 
			 
			 
			 //ТЗ=ТЧ.Выгрузить();
			 
			
			 Для каждого стркД Из ТЧ  Цикл
			     
			     	 стрНовая= ТЗ.Добавить();
					 Для каждого колонка Из ТЗ.Колонки  Цикл
						 
			    	         стрНовая[колонка.Имя]=стркД[колонка.Имя];
			    	 	
			    	 
			    	 КонецЦикла;  
			    	 
			 	
			 
			 КонецЦикла;
			 
				
				
				
	 		
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
			    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	*
					|ПОМЕСТИТЬ ТВ_ТВ
					|ИЗ
					|	&ТЗ КАК ТЗ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	*
					|ИЗ
					|	ТВ_ТВ КАК ТВ_ТВ";
				

			
				
		        Запрос.УстановитьПараметр("ТЗ", ТЗ);
				
				РезультатЗапроса = Запрос.Выполнить();
		        РезТз = ТЗ.Скопировать();
				
				
		 			   ТД = Новый ТабличныйДокумент;
			
						Заголовки = Новый Структура;
			            ОбластьВывода = ТД.ПолучитьОбласть(1, 1, 1, РезТз.Колонки.Количество());
					    Для Счетчик = 1 по РезТз.Колонки.Количество() Цикл
					        ОбластьЗаполнения = ОбластьВывода.Область(1, Счетчик, 1, Счетчик);
					        Колонка = РезТз.Колонки[Счетчик-1];
					        ОбластьЗаполнения.Параметр = Колонка.Имя;
					        ОбластьЗаполнения.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
					        Заголовки.Вставить(Колонка.Имя, Колонка.Заголовок);
							
					    КонецЦикла;
					    ОбластьВывода.Параметры.Заполнить(Заголовки);
						
					    ТД.Вывести(ОбластьВывода);
					    Выборка=РезультатЗапроса.Выбрать();
					    Пока Выборка.Следующий() Цикл
					        ОбластьВывода.Параметры.Заполнить(Выборка);
					        ТД.Вывести(ОбластьВывода);
					    КонецЦикла;
						
						
						
	
				//Построитель = Новый ПостроительОтчета;
				//Построитель.ИсточникДанных  = Новый ОписаниеИсточникаДанных(РезТз);
				//ТД = Новый ТабличныйДокумент;
				//Построитель.Вывести(ТД);
				//
				 //

      Возврат ТД;
				 
КонецФункции // ()
